-- 计算机学院 01
INSERT INTO classes (class_name, class_code, major_id, college_id)
VALUES
('计算机科学与技术2021级1班', '2021010101', 1, 1),
('计算机科学与技术2021级2班', '2021010102', 1, 1),

('软件工程2022级1班', '2022010201', 2, 1),
('软件工程2022级2班', '2022010202', 2, 1),

('数据科学与大数据技术2023级1班', '2023010301', 3, 1),
('数据科学与大数据技术2023级2班', '2023010302', 3, 1);

-- 电子信息学院 02
INSERT INTO classes (class_name, class_code, major_id, college_id)
VALUES
('电子信息工程2021级1班', '2021020101', 4, 2),
('电子信息工程2021级2班', '2021020102', 4, 2),

('通信工程2022级1班', '2022020201', 5, 2),
('通信工程2022级2班', '2022020202', 5, 2),

('人工智能2023级1班', '2023020301', 6, 2),
('人工智能2023级2班', '2023020302', 6, 2);

-- 机械工程学院 03
INSERT INTO classes (class_name, class_code, major_id, college_id)
VALUES
('机械设计制造2021级1班', '2021030101', 7, 3),
('机械设计制造2021级2班', '2021030102', 7, 3),

('车辆工程2022级1班', '2022030201', 8, 3),
('车辆工程2022级2班', '2022030202', 8, 3),

('智能制造工程2023级1班', '2023030301', 9, 3),
('智能制造工程2023级2班', '2023030302', 9, 3);